using System.IO;
using UnityEngine;

public class ContentLoad : MonoBehaviour
{
    string NameStat = "{\"прилагательные\":[\"Вредный\",\"Особый\",\"Магнитный\",\"Смешливый\",\"Искренний\",\"Сердечный\",\"Лекарственный\",\"Временной\",\"Мрачный\",\"Излишний\",\"Совершенный\",\"Нежный\",\"Хитрый\",\"Блестящий\",\"Механический\",\"Незаконный\",\"Истинный\",\"Патийный\",\"Детский\",\"Мировой\",\"Фирменный\",\"Солнечный\",\"Федеральный\",\"Классный\",\"Мудрый\",\"Православный\",\"Будущий\",\"Зелёный\",\"Быстрый\",\"Неизвестный\"],\"существительные\":[\"топор\",\"кубик\",\"меч\",\"пистолет\",\"лук\",\"укол\",\"щит\",\"ластик\",\"воин\",\"задира\",\"гранатомёт\",\"автомат\",\"волк\",\"костыль\"]}";
    [SerializeField] FileInfo Mask; 
    private void Start()
    {
        if (PlayerPrefs.GetInt("FirstRun",0) == 0)
        {
            SaveContent();
            PlayerPrefs.SetInt("FirstRun",1);
        }
    }
    private void SaveContent()
    {
        File.WriteAllText(Application.persistentDataPath + "/NamesStat.json", NameStat);
        
    }
    
}
